In [1]:
import pandas as pd
import numpy as np

In [2]:
# creating a dataframe using pandas
# geting information about any function press shift+tab

df = pd.DataFrame(np.arange(0,20).reshape(5,4))

In [3]:
# to wtch the top 5 elements

df.head()

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [4]:
# to set the row and column index name

df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=('r1','r2','r3','r4','r5'),columns=('c1','c2','c3','c4'))

In [5]:
df.head()

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

In [6]:
# get the shape of the data

df.shape

(5, 4)

In [7]:
# accesing element
# 1. loc - location
# 2. iloc - index location

df.loc['r1']

c1    0
c2    1
c3    2
c4    3
Name: r1, dtype: int32

In [8]:
# series means tht one cloumn and many row and vice-versa

type(df.loc['r1'])

pandas.core.series.Series

In [9]:
# [rows,columns]

df.iloc[:,:]

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

In [10]:
df.iloc[0:3,1:]

    c2  c3  c4
r1   1   2   3
r2   5   6   7
r3   9  10  11

In [11]:
df.iloc[::-1]

    c1  c2  c3  c4
r5  16  17  18  19
r4  12  13  14  15
r3   8   9  10  11
r2   4   5   6   7
r1   0   1   2   3

In [12]:
# CONVERT DF TO ARRAY

df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [13]:
df['c1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: c1, dtype: int64

In [14]:
# to want get the unique values

df['c1'].unique()

array([ 0,  4,  8, 12, 16])

In [15]:
# import data

df = pd.read_csv('mercedesbenz.csv')

df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [16]:
df.shape

(4209, 378)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [18]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [19]:
data = ('col,col2,col3\n'
       '1,5,6\n'
       '7,6,23\n'
       '1,2,3')

In [20]:
from io import StringIO,BytesIO

In [21]:
df = pd.read_csv(StringIO(data))

# StringIO() is used for reading a string format document into df

In [22]:
df.head()

   col  col2  col3
0    1     5     6
1    7     6    23
2    1     2     3

In [23]:
df = pd.read_csv(StringIO(data),usecols =[x.lower() for x in ['col','col2']])

In [24]:
df.head()

   col  col2
0    1     5
1    7     6
2    1     2

In [25]:
# convert the datatype while load the data

df = pd.read_csv(StringIO(data),dtype=object)

In [26]:
df.dtypes

col     object
col2    object
col3    object
dtype: object

In [27]:
df.head()

  col col2 col3
0   1    5    6
1   7    6   23
2   1    2    3

In [28]:
df['col'][1]

'7'

In [29]:
# to set a particular data type for particular column


df = pd.read_csv(StringIO(data),dtype={'col':object,'col2':float})

In [30]:
df.dtypes

col      object
col2    float64
col3      int64
dtype: object

In [31]:
data =('index,a,b,c\n'
      'apple,4,6,7\n'
      'orange,6,2,9')

In [32]:
df = pd.read_csv(StringIO(data))

In [33]:
df.head()

    index  a  b  c
0   apple  4  6  7
1  orange  6  2  9

In [34]:
df = pd.read_csv(StringIO(data),index_col=0)
df.head()

        a  b  c
index
apple   4  6  7
orange  6  2  9

In [35]:
data = ('index,apple,orange\n'
       '1,orange,bt,\n'
       '2,man,woman,')

In [36]:
df = pd.read_csv(StringIO(data),index_col=False)
df.head()

   index   apple orange
0      1  orange     bt
1      2     man  woman

In [37]:
data = 'a,b\n"hello,\\mosh\\",nice to see you",5'

In [38]:
pd.read_csv(StringIO(data),escapechar='\\')

                             a  b
0  hello,mosh",nice to see you  5

In [39]:
# \t used for tab as a separator was used

In [46]:
# importing json files

data =  '{"employee_name": "James", "email": "james@gmail.com","job_profile": [{"title1":"Team Lead", "title2":"Sr. Developer"}]}'
df = pd.read_json(data)
df

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [47]:
df.to_json(orient='records')

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title1":"Team Lead","title2":"Sr. Developer"}}]'

In [48]:
df.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title1":"Team Lead","title2":"Sr. Developer"}}}'

### Reading HTML

In [49]:
url = 'https://www.fdic.gov/bank/individual/failed/banklist.html'

dfh = pd.read_html(url)

In [52]:
dfh[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [57]:
url_mcc = 'https://en.wikipedia.org/wiki/Mobile_country_code'
dfs = pd.read_html(url_mcc, match='Mobile country code', header=0)

# here the match will used to pickup a particular table we want
# and we did it by matching the any one coulmn name for it

In [59]:
type(dfs)

list

In [58]:
# list object does not have head function so only we mention this like this way

dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

### Reading excel

In [75]:
df_ex = pd.read_excel('2011-vote.xlsx',index_col=0,header=1)

#to read particular sheet means

df_ex1 = pd.read_excel('2011-vote.xlsx',index_col=0,header=1,sheet_name=1)

In [77]:
df_ex.head()

                  Unnamed: 1 Seats won Change Popular vote Vote % Adj. %‡
Alliance/Party
AIADMK+ alliance         NaN       203    130     19085762  0.519     NaN
AIADMK                   NaN       150     93     14150289  0.384   0.539
DMDK                     NaN        29     28      2903828  0.079   0.448
CPI(M)                   NaN        10      1       888364  0.024   0.503
CPI                      NaN         9      3       727394   0.02   0.486

In [78]:
df_ex1.head()

,Unnamed: 1,Votes,%,Seats,Unnamed: 5,Unnamed: 6
Parties and Coalitions,,,,,,
NaN,NaN,NaN,NaN,Contested,Won,+/-
NaN,All India Anna Dravida Munnetra Kazhagam (AIADMK),17806490.0,0.4088,234,136,14
NaN,Dravida Munnetra Kazhagam (DMK),13670511.0,0.3139,178,89,66
NaN,Indian National Congress (DMK),2774075.0,0.0647,41,8,3
NaN,Indian Union Muslim League (DMK),313808.0,0.0073,5,1,1

### Pickling

All pandas objects are equipped with to_pickle methods which use Python’s cPickle module to save data structures to disk using the pickle format.

In [79]:
df_ex.to_pickle('df_ex_pickle')

In [80]:
df1 = pd.read_pickle('df_ex_pickle')

In [81]:
type(df1)

pandas.core.frame.DataFrame

In [83]:
df1.head()

                  Unnamed: 1 Seats won Change Popular vote Vote % Adj. %‡
Alliance/Party
AIADMK+ alliance         NaN       203    130     19085762  0.519     NaN
AIADMK                   NaN       150     93     14150289  0.384   0.539
DMDK                     NaN        29     28      2903828  0.079   0.448
CPI(M)                   NaN        10      1       888364  0.024   0.503
CPI                      NaN         9      3       727394   0.02   0.486